# Задания с использованием вложенных циклов.

 На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1) Строится двоичная запись числа N.
2)   Затем справа дописываются два разряда: символы 01, если число N чётное, и 10, если нечётное.
Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R. Укажите минимальное число R, большее 130, которое может являться результатом работы этого алгоритма. В ответе это число запишите в десятичной системе.

```
  for n in range(1, 100): #программа для перебора
    r = bin(n) [2 :] # убрать лишние 2 символа при переводе в двоич. систему
    print(r) # вывод
    if n % 2 == 0: # дописывается 01, если число N чётное, и 10 если не четное
        r+= '01'
    else:
        r+= '10'
    print(n, r)
```
```
for n in range(1, 100): #программа для перебора
    r = bin(n) [2:] # убрать лишние 2 символа при переводе в двоич. систему
    if n % 2 == 0: # дописывается 01, если число N чётное, и 10 если не четное
        r+= '01'
    else:
        r+= '10'
    if int(r, 2) > 130: # Условие для облегченного решения
        print(int(r, 2))
```

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1) Строится двоичная запись числа N.
2) К этой записи дописывается справа бит чётности: 0, если в двоичном коде числа N было чётное число единиц, и 1, если нечётное.
3) К полученному результату дописывается ещё один бит чётности. Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R.
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число, большее, чем 184. В ответе это число запишите в десятичной системе.
```
for n in range(1, 100):
    r = bin(n)[2:]
    if r.count('1') % 2 == 0: # дописывается справа бит чётности: 0, если в двоичном коде числа N было чётное число единиц, и 1, если нечётное.
        r += '0'
    else:
        r += '1'
        if r.count('1') % 2 == 0: #К полученному результату дописывается ещё один бит чётности
            r += '0'
        else:
            r += '1' #Указать минимальное число N, после обработки которого с помощью этого алгоритма получается число, большее, чем 184
        if int(r, 2) > 184:
            print(n)
```
