# Задания с использованием вложенных циклов.
## Тип 2 №48423
Логическая функция F задаётся выражением: (x → (y ≡ w)) ∧ (y ≡ (w → z)).Дан частично заполненный фрагмент, 
содержащий неповторяющиеся строки таблицы истинности функции F.Определите, 
какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.В ответе напишите буквы x, y, z, w в 
том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу;затем  — буква,
соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

```
for w in range(2):
    for x in range(2):
        for y in range(2):
            for z in range(2):
                if ((x <= (y == w)) and (y == (w <= z))) == False:
                    print(w, x, y, z)
```
Ответ: yxwz

## Тип 2 №51971
Логическая функция F задаётся выражением: (x ≡ ¬y) → ((z → ¬w) ∧ (w → y)).Дан частично заполненный фрагмент, содержащий неповторяющиеся
строки таблицы истинности функции F.Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.В ответе напишите
буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, 
соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

```
for w in range(2):
    for x in range(2):
        for y in range(2):
            for z in range(2):
                if not((x == (not y)) <= ((z<=(not w)) and (w <= y))):
                    print(w, x, y, z)
```
Ответ: ywzx

## Тип 2 №56502
Логическая функция F задаётся выражением:((x → y)∨(z → w))∧((z ≡ y) → (w ≡ x)).Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных w, x, y, z. 
В ответе напишите буквы w, x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; 
затем буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
```
for w in range(2):
    for x in range(2):
        for y in range(2):
            for z in range(2):
                if (((x<=y)or (z<=w)) and ((z==y)<=(w==x)))==0:
                    print(w, x, y, z)
```
Ответ: yxwz

## Тип 8 №37143
Ученица составляет 5-⁠буквенные слова из букв ГЕПАРД. При этом в каждом слове ровноодна буква Г,слово
не может начинаться на букву А и заканчиваться буквой Е. Какое количество слов может составить ученица?

```
letters = 'ГЕПАРД'
count = 0
for a in letters:
    for b in letters:
        for c in letters:
            for d in letters:
                for e in letters:
                    word = a + b + c + d + e
                    if word.count('Г') != 1:
                        continue
                    if word[0] == 'А':
                        continue
                    if word[4] == 'Е':
                        continue
                    count += 1
print(count)
```
Ответ: 2200

## Тип 8 №18558
Иван составляет 5-⁠буквенные коды из букв И, В, А, Н. Буквы в коде могут повторяться, использовать все буквы 
не обязательно, но букву И нужно использовать хотя бы один раз. Сколько различных кодов может составить Иван?

```
letters = 'ИВАН'
count = 0
for a in letters:
    for b in letters:
        for c in letters:
            for d in letters:
                for e in letters:
                    word = a + b + c + d + e
                    if word.count('И') == 0:
                        continue
                    count += 1
print(count)
```
Ответ: 781

## Тип 8 №78033
Все 5⁠-⁠буквенные слова, в составе которых могут быть только буквы Э, Л, Ь, Б, Р, У, С, записаны в алфавитном порядке и пронумерованы.
Вот начало списка:
1.  БББББ
2.  ББББЛ
3.  ББББР
4.  ББББС
5.  ББББУ
6.  ББББЬ
...
Под каким номером в списке идёт последнее слово c чётным номером, которое содержит не менее двух букв С, одну букву Л и не содержит букв Э, стоящих рядом?
```
letters = ['Б', 'Л', 'Р', 'С', 'У', 'Ь', 'Э']
count = 0
last_even = 0

for a in letters:
    for b in letters:
        for c in letters:
            for d in letters:
                for e in letters:
                    count += 1
                    if count % 2 == 0:
                        word = a + b + c + d + e
                        if word.count('С') >= 2 and word.count('Л') == 1 and 'ЭЭ' not in word:
                            last_even = count
print(last_even)
```
